УРВ_файловая/src/InformationRegisters/ПодпискиНаБизнесСобытия/ПодпискиНаБизнесСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодпискиНаБизнесСобытия</name>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Потребитель</name>
    <type>
      <types>EnumRef.ПотребителиБизнесСобытий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/ПодпискиНаУведомления/ПодпискиНаУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодпискиНаУведомления</name>
  <resources>
    <name>ПодпискаАктивна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
      <types>EnumRef.СобытияУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПодписки</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.Обращение</types>
      <types>CatalogRef.Ошибки</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Enums/ПотребителиБизнесСобытий/ПотребителиБизнесСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПотребителиБизнесСобытий</name>
  <enumValues>
    <name>АвтоматическийЗапускБизнесПроцессов</name>
  </enumValues>
  <enumValues>
    <name>РассылкаУведомлений</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/InformationRegisters/ПодпискиНаБизнесСобытия/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы
    
&НаКлиенте
Процедура ОткрытьЭлементСписка(Элемент)
	
	Если Элемент.ТекущиеДанные.Потребитель = ПредопределенноеЗначение("Перечисление.ПотребителиБизнесСобытий.АвтоматическийЗапускБизнесПроцессов") Тогда
		
		ПараметрыФормы = Новый Структура("ВидСобытия", Элемент.ТекущиеДанные.ВидСобытия);
		ОткрытьФорму(
			"РегистрСведений.ПравилаАвтоматическогоЗапускаБизнесПроцессов.Форма.ФормаСпискаУниверсальнаяДляВидаСобытия", 
			ПараметрыФормы);
		
	ИначеЕсли Элемент.ТекущиеДанные.Потребитель = ПредопределенноеЗначение("Перечисление.ПотребителиБизнесСобытий.РассылкаУведомлений") Тогда
		
		ПараметрыФормы = Новый Структура("ВидСобытия", Элемент.ТекущиеДанные.ВидСобытия);
		ОткрытьФорму(
			"РегистрСведений.ПодпискиНаУведомления.ФормаСписка", 
			ПараметрыФормы);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
    
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьЭлементСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЭлементСписка(Элемент);
	
КонецПроцедуры

#КонецОбласти
